cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'caskroom/fonts'

brew 'ack'
brew 'coreutils'
brew 'flyway'
brew 'go'
brew 'grc'
brew 'openssl'
brew 'packer'
brew 'node'
brew 'readline'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'terraform'
brew 'unrar'
brew 'wget'
brew 'yarn'

cask 'aerial'
cask 'alfred'
cask 'atom'
cask 'chefdk'
cask 'docker'
cask 'docker-toolbox'
cask 'firefox'
cask 'font-fira-code'
cask 'google-chrome'
cask 'hipchat'
cask 'iterm2'
cask 'istat-menus'
cask 'java'
cask 'microsoft-office'
cask 'paw'
cask 'postman'
cask 'rescuetime'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'transmit'
cask 'whatsapp'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'zoomus'
