cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'
tap 'caskroom/fonts'
tap 'aws/tap'
tap 'mas-cli/tap', pin: true


brew 'ack'
brew 'awscli'
brew 'aws-sam-cli'
brew 'coreutils'
#brew 'flyway'
brew 'git-flow'
brew 'go'
# If have issues with the next step follow steps listed below.
# https://github.com/go-delve/homebrew-delve/issues/19
#brew 'go-delve/delve/delve'
brew 'grc'
brew 'jq'
brew 'mas'
brew 'openssl'
brew 'packer'
brew 'nmap'
brew 'node'
brew 'readline'
brew 'puma/puma/puma-dev'
brew 'pyenv'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'terraform'
brew 'unrar'
brew 'wget'
brew 'yarn'

cask 'aerial'
cask 'alfred'
cask 'amazon-chime'
cask 'amazon-workdocs'
cask 'amazon-workspaces'
cask 'android-file-transfer'
cask 'chefdk'
cask 'docker'
cask 'docker-toolbox'
cask 'firefox'
cask 'font-fira-code'
cask 'google-chrome'
cask 'hipchat'
cask 'iterm2'
cask 'istat-menus'
cask 'java'
# cask 'microsoft-office'
cask 'paw'
cask 'pgadmin4'
cask 'postman'
cask 'rescuetime'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'teamviewer'
cask 'transmit'
cask 'whatsapp'
cask 'vagrant'
cask 'virtualbox'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'

# Installing from the Mac App Store via mas
# https://github.com/mas-cli/mas
mas "irvue", id: 1039633667
mas "Microsoft Remote Desktop 10", id: 1295203466
mas "LastPass Password Manager", id: 926036361
mas "Xcode", id: 497799835
mas "LastPass", id: 926036361
mas "Bear", id: 1091189122